[  {    "itemType": "book",    "title": "To Kill a Mockingbird",    "author": "Harper Lee",    "desc": "A classic novel set in the South during the 1930s, focusing on the trial of a black man accused of raping a white woman."  },  {    "itemType": "book",    "title": "The Catcher in the Rye",    "author": "J.D. Salinger",    "desc": "A coming-of-age novel that follows a teenager named Holden Caulfield as he wanders around New York City after getting expelled from his prep school."  },  {    "itemType": "book",    "title": "The Lord of the Rings",    "author": "J.R.R. Tolkien",    "desc": "A trilogy of fantasy novels set in the world of Middle-earth, following hobbit Frodo Baggins as he journeys to destroy the One Ring."  },  {    "itemType": "book",    "title": "1984",    "author": "George Orwell",    "desc": "A dystopian novel set in a future where the government has total control over every aspect of citizens' lives, and where independent thought is punished."  },  {    "itemType": "book",    "title": "Pride and Prejudice",    "author": "Jane Austen",    "desc": "A classic novel about the lives of the Bennett sisters and their attempts to find love and marriage in Georgian-era England."  },  {    "itemType": "book",    "title": "The Great Gatsby",    "author": "F. Scott Fitzgerald",    "desc": "A novel set in the Roaring Twenties that explores themes of love, wealth, and the American Dream through the story of millionaire Jay Gatsby."  },  {    "itemType": "book",    "title": "One Hundred Years of Solitude",    "author": "Gabriel Garcia Marquez",    "desc": "A magical realist novel that tells the story of the Buendia family over the course of seven generations in the fictional town of Macondo."  },  {    "itemType": "book",    "title": "The Hitchhiker's Guide to the Galaxy",    "author": "Douglas Adams",    "desc": "A comedic science fiction novel that follows the misadventures of hapless human Arthur Dent and his alien friend Ford Prefect as they travel through space."  },  {    "itemType": "book",    "title": "The Chronicles of Narnia",    "author": "C.S. Lewis",    "desc": "A series of seven fantasy novels that follow the adventures of a group of children who stumble upon a magical world called Narnia."  },  {    "itemType": "book",    "title": "The Diary of a Young Girl",    "author": "Anne Frank",    "desc": "A memoir that chronicles the experiences of a young Jewish girl named Anne Frank during World War II, as she and her family hide from the Nazis in Amsterdam."  }]
